abradianu/esp32_iot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_ECC_ENABLE=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED=80
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y

# For FreeRTOS tasks debug
#CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
